/* title: Direct-Memory-Access

   Gibt Zugriff auf

      o 7 uabhängige Kanäle gesteuert von Controller DMA1.
      o Zusätzlich 5 uabhängige Kanäle gesteuert von Controller DMA2.
      o DMA1 und DMA2 teilen sich den Bus untereinander und mit der CPU
        im round-robin Verfahren.
      o Bis zu 65535 Datenwörter können in einer Transaktion übertragen
        werden.
      o Datenwörter sind 8Bit, 16Bit oder 32Bit groß.
      o Datenübertragungen werden zwischen aktiven DMA unterstützenden
        Peripheriebausteinen und Speicher (Flash, (S)RAM) in beiden
        Richtungen unterstützt.
      o Es werden auch Speicher-Speicher Datenübertragungen unterstützt
        (Konfigurationsflag dmacfg_NOTRIGGER).
      o 4 durch Software programmierbare Prioritäten werden zwischen den Kanälen
        innerhalb eine Controllers unterstützt.

   Die DMA-Hardwareunit läuft mit demselben Takt wie die CPU (HCLK).

   Beide DMA-Controller können unabhängig auf interne Busse zugreifen.
   Greifen die CPU und ein Controller oder beide Controller gleichzeitig
   auf ein- und denselben Bus zu (der µC besitzt mehrere Datenbusse),
   so müssen sie sich den Bus teilen. Die interne Bus-Matrix implementiert
   ein round-robin Verfahren und sichert der CPU mindesten 50% des Datenverkehrs
   zu.

   Eine DMA-Datenübertragung (Transaktion) ist genau einem Kanal zugeordnet.
   Jeder Kanal unterstützt Speicher-zu-Speicher Datenübertragungen, aber

   dmacfg_MEM_32BITDATA = 2u << 10, // size of transfered data item from/to memory is 32Bit
   // -- 3. choose one of --
   dmacfg_PRIORITY_MAX = 3u << 12,
   dmacfg_PRIORITY_HIGH = 2u << 12,
   dmacfg_PRIORITY_LOW = 1u << 12,
   dmacfg_PRIORITY_MIN = 0u << 12,  // (default)
   // -- 4. choose one of --
   dmacfg_MEM_READ  = 1u << 4,
   dmacfg_MEM_WRITE = 0u << 4,      // (default)
   // -- 5. additonal flags ored to others. Default is disabled --
   dmacfg_NOTRIGGER    = 1u << 14,  // no trigger from peripheral hwunit needed, copy data items as fast as possible after channel is enabled
                                    // useful for memory to memory copy where there is no peripheral trigger
   dmacfg_LOOP         = 1u << 5,   // at end of transfer restart from beginning (makes no sense for mem-to-mem copy but is supported)
   dmacfg_MEM_INCRADDR = 1u << 7,
   dmacfg_HW_INCRADDR  = 1u << 6,
   dmacfg_ENABLE       = 1 << 0,
   dmacfg_INTERRUPT_ERROR    = 1 << 3,
   dmacfg_INTERRUPT_HALF     = 1 << 2,
   dmacfg_INTERRUPT_COMPLETE = 1 << 1,
   dmacfg_INTERRUPT          = dmacfg_INTERRUPT_ERROR | dmacfg_INTERRUPT_HALF | dmacfg_INTERRUPT_COMPLETE,
} dmacfg_e;


// == exported functions

static inline int config_dma(volatile struct dma_t *dma, dma_channel_e channel, volatile void *hwunit/*_HW_*/, volatile void *memory/*_MEM_*/, uint16_t datacount, dmacfg_e config);
static inline int config_flash_dma(volatile struct dma_t *dma, dma_channel_e channel, volatile void *hwunit/*_HW_*/, const void *flashmem/*_MEM_*/, uint16_t datacount, dmacfg_e config);
static inline int config_copy_dma(volatile struct dma_t *dma, dma_channel_e channel, volatile void *hwunit/*_HW_*/, volatile const void *memory/*_MEM_*/, uint16_t datacount, dmacfg_e config);
static inline int config_copyflash_dma(volatile struct dma_t *dma, dma_channel_e channel, volatile void *hwunit/*_HW_*/, const void *flashmem/*_MEM_*/, uint16_t datacount, dmacfg_e config);
static inline int isenabled_dma(const volatile struct dma_t *dma, dma_channel_e channel/*DMA1:0..6/DMA2:0..4*/);
static inline int enable_dma(volatile struct dma_t *dma, dma_channel_e channel/*DMA1:0..6/DMA2:0..4*/);
static inline int disable_dma(volatile struct dma_t *dma, dma_channel_e channel/*DMA1:0..6/DMA2:0..4*/);
static inline int enable_interrupt_dma(volatile struct dma_t *dma, dma_channel_e channel, dmacfg_e config/*masked with dmacfg_INTERRUPT*/);
static inline int disable_interrupt_dma(volatile struct dma_t *dma, dma_channel_e channel, dmacfg_e config/*masked with dmacfg_INTERRUPT*/);
static inline uint32_t counter_dma(const volatile struct dma_t *dma, dma_channel_e channel);
static inline dma_state_e state_dma(const volatile struct dma_t *dma, dma_channel_e channel);
static inline void clearstate_dma(volatile struct dma_t *dma, dma_channel_e channel, dma_state_e state);


// == definitions

/* struct: dma_t
 * Definiert die Register der integrierten DMA-Hardwareunit.
 *
 * Invariant:
 * Reserved bits must be kept at reset value (for all register). */
typedef volatile struct dma_t {
   /* DMA interrupt status register (DMA_ISR); Address offset: 0x00; Reset value: 0x00000000 */
   uint32_t    isr;
   /* DMA interrupt flag clear register (DMA_IFCR); Address offset: 0x04; Reset value: 0x00000000
    * Write 1 to bit position to clear flag in isr.
    * GIFx: Channel x global interrupt clear write 1: Clears the GIF, TEIF, HTIF and TCIF flags in the DMA_ISR register */
   uint32_t    ifcr;
   struct {
      /* DMA channel x configuration register (DMA_CCRx) (x = 1..7 , where x = channel number)
       * Address offset: 0x08 + 20 × (channel number – 1); Reset value: 0x00000000
       * All bits are set by software. */
      uint32_t    ccr;
      /* DMA channel x number of data register (DMA_CNDTRx) (x = 1..7, where x = channel number)
       * Address offset: 0x0C + 20 × (channel number – 1); Reset value: 0x00000000
       * Bits 15:0 NDT[15:0]: Number of data to be transferred (0 up to 65535).
       * This register can only be written when the channel is disabled.
       * This register is decremented by one every time a data item is transfered. */
      uint32_t    cndtr;
      /* DMA channel x peripheral address register (DMA_CPARx) (x = 1..7, where x = channel number)
       * Address offset: 0x10 + 20 × (channel number – 1); Reset value: 0x00000000
       * This register must not be written when the channel is enabled.
       * Bits 31:0 PA[31:0]: Peripheral address
       * Base address of the peripheral data register from/to which the data will be read/written.
       * Access is automatically aligned to a half-word or word address (PA[0] or PA[1:0] ignored).
       * This register keeps its configured initial value during a transaction. */
      uint32_t    cpar;
      /* DMA channel x memory address register (DMA_CMARx) (x = 1..7, where x = channel number)
       * Address offset: 0x14 + 20 × (channel number – 1); Reset value: 0x00000000
       * Bits 31:0 MA[31:0]: Memory address
       * Base address of the memory area from/to which the data will be read/written.
       * Access is automatically aligned to a half-word or word address (MA[0] or MA[1:0] ignored).
       * This register keeps its configured initial value during a transaction. */
      uint32_t    cmar;
      uint32_t    _reserved1;
   } channel[7];
} dma_t;


// == Bit Definitionen

// DMA interrupt status register (DMA_ISR)
// Bits per channel. 3:0 first channel, 7:4 2nd channel, ...
#define HW_BIT_DMA_ISR_CHANNEL_BITS       0x4
// Number of channels in the ISR register 1..7
#define HW_BIT_DMA_ISR_CHANNEL_NROF       0x7
// All bits in one channel
#define HW_BIT_DMA_ISR_CHANNEL_MASK       0xf
// Channel 1 transfer error flag (set hw, cleared by sw with DMA_IFCR), 1: A transfer error (TE) occurred on channel 1
#define HW_BIT_DMA_ISR_TEIF1              (1u << 3)
// Channel 1 half transfer flag (set hw, cleared by sw with DMA_IFCR), 1: A half transfer (HT) event occurred on channel 1
#define HW_BIT_DMA_ISR_HTIF1              (1u << 2)
// Channel 1 transfer complete flag (set hw, cleared by sw with DMA_IFCR), 1: A transfer complete (TC) event occurred on channel 1
#define HW_BIT_DMA_ISR_TCIF1              (1u << 1)
// Channel 1 global interrupt flag (set hw, cleared by sw with DMA_IFCR), 1: A TE, HT or TC event occurred on channel 1
#define HW_BIT_DMA_ISR_GIF1               (1u << 0)

// DMA channel configuration register (DMA_CCR)
// Bit 14 MEM2MEM: Memory to memory mode
#define HW_BIT_DMA_CCR_MEM2MEM            (1u << 14)
// Bits 13:12 PL[1:0]: Channel priority level, 00: Low, 01: Medium, 10: High, 11: Very high
#define HW_BIT_DMA_CCR_PL_POS             12u
#define HW_BIT_DMA_CCR_PL_BITS            0x3
#define HW_BIT_DMA_CCR_PL_MASK            HW_REGISTER_MASK(DMA, CCR, PL)
// Bits 11:10 MSIZE[1:0]: Memory size, 00: 8-bits, 01: 16-bits, 10: 32-bits, 11: Reserved
#define HW_BIT_DMA_CCR_MSIZE_POS          10u
#define HW_BIT_DMA_CCR_MSIZE_BITS         0x3
#define HW_BIT_DMA_CCR_MSIZE_MASK         HW_REGISTER_MASK(DMA, CCR, MSIZE)
// Bits 9:8 PSIZE[1:0]: Peripheral size, 00: 8-bits, 01: 16-bits, 10: 32-bits, 11: Reserved
#define HW_BIT_DMA_CCR_PSIZE_POS          8u
#define HW_BIT_DMA_CCR_PSIZE_BITS         0x3
#define HW_BIT_DMA_CCR_PSIZE_MASK         HW_REGISTER_MASK(DMA, CCR, PSIZE)
// Bit 7 MINC: Memory increment mode, 1: Memory increment mode enabled
#define HW_BIT_DMA_CCR_MINC               (1u << 7)
// Bit 6 PINC: Peripheral increment mode, 1: Peripheral increment mode enabled
#define HW_BIT_DMA_CCR_PINC               (1u << 6)
// Bit 5 CIRC: Circular mode, 1: Circular mode enabled
#define HW_BIT_DMA_CCR_CIRC               (1u << 5)
// Bit 4 DIR: Data transfer direction, 0: Read from peripheral, 1: Read from memory
#define HW_BIT_DMA_CCR_DIR                (1u << 4)
// Bit 3 TEIE: Transfer error interrupt enable, 1: TE interrupt enabled
#define HW_BIT_DMA_CCR_TEIE               (1u << 3)
// Bit 2 HTIE: Half transfer interrupt enable, 1: HT interrupt enabled
#define HW_BIT_DMA_CCR_HTIE               (1u << 2)
// Bit 1 TCIE: Transfer complete interrupt enable, 1: TC interrupt enabled
#define HW_BIT_DMA_CCR_TCIE               (1u << 1)
// Bit 0 EN: Channel enable, 1: Channel enabled
#define HW_BIT_DMA_CCR_EN                 (1u << 0)


// section: inline implementation

static inline void assert_dmabits_dma(void)
{
   // DMAX_BIT can be used for enable_dma_clockcntrl
   static_assert(HW_BIT_RCC_AHBENR_DMA1EN == DMA1_BIT);
   static_assert(HW_BIT_RCC_AHBENR_DMA2EN == DMA2_BIT);

   static_assert(dma_state_ERROR    == HW_BIT_DMA_ISR_TEIF1);
   static_assert(dma_state_HALF     == HW_BIT_DMA_ISR_HTIF1);
   static_assert(dma_state_COMPLETE == HW_BIT_DMA_ISR_TCIF1);
}

static inline void assert_offsets_dma(void)
{
      static_assert(offsetof(dma_t, isr)   == 0x00);
      static_assert(offsetof(dma_t, ifcr)  == 0x04);
      static_assert(offsetof(dma_t, channel[0].ccr)   == 0x08);
      static_assert(offsetof(dma_t, channel[0].cndtr) == 0x0c);
      static_assert(offsetof(dma_t, channel[0].cpar)  == 0x10);
      static_assert(offsetof(dma_t, channel[0].cmar)  == 0x14);
      static_assert(offsetof(dma_t, channel[1].ccr)   == 0x08+1*20);
      static_assert(offsetof(dma_t, channel[1].cndtr) == 0x0c+1*20);
      static_assert(offsetof(dma_t, channel[1].cpar)  == 0x10+1*20);
      static_assert(offsetof(dma_t, channel[1].cmar)  == 0x14+1*20);
      static_assert(offsetof(dma_t, channel[6].ccr)   == 0x08+6*20);
      static_assert(offsetof(dma_t, channel[6].cndtr) == 0x0c+6*20);
      static_assert(offsetof(dma_t, channel[6].cpar)  == 0x10+6*20);
      static_assert(offsetof(dma_t, channel[6].cmar)  == 0x14+6*20);
}

static inline void assert_dmcfg_dma(void)
{
   static_assert(dmacfg_PRIORITY_MAX == 3 << HW_BIT_DMA_CCR_PL_POS);
   static_assert(dmacfg_PRIORITY_HIGH == 2 << HW_BIT_DMA_CCR_PL_POS);
   static_assert(dmacfg_PRIORITY_LOW == 1 << HW_BIT_DMA_CCR_PL_POS);
   static_assert(dmacfg_PRIORITY_MIN == 0 << HW_BIT_DMA_CCR_PL_POS);
   static_assert(dmacfg_MEM_8BITDATA  == 0 << HW_BIT_DMA_CCR_MSIZE_POS);
   static_assert(dmacfg_MEM_16BITDATA == 1 << HW_BIT_DMA_CCR_MSIZE_POS);
   static_assert(dmacfg_MEM_32BITDATA == 2 << HW_BIT_DMA_CCR_MSIZE_POS);
   static_assert(dmacfg_HW_8BITDATA  == 0 << HW_BIT_DMA_CCR_PSIZE_POS);
   static_assert(dmacfg_HW_16BITDATA == 1 << HW_BIT_DMA_CCR_PSIZE_POS);
   static_assert(dmacfg_HW_32BITDATA == 2 << HW_BIT_DMA_CCR_PSIZE_POS);
   static_assert(dmacfg_NOTRIGGER          == HW_BIT_DMA_CCR_MEM2MEM);
   static_assert(dmacfg_MEM_INCRADDR == HW_BIT_DMA_CCR_MINC);
